Revit 2027 API
StructuralSectionGeneralT.FlangeFillet Property
 Flange Fillet - fillet radius at the flange end.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FlangeFillet { get; set; }
Public Property FlangeFillet As Double
	Get
	Set
public:
property double FlangeFillet {
	double get ();
	void set (double value);
}
member FlangeFillet : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionGeneralT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace